//*Terms of use

const String termsofuse = """ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ ОБ ИСПОЛЬЗОВАНИИ
МОБИЛЬНОГО ПРИЛОЖЕНИЯ «MOBILITY»
(редакция № 2)
Общество с ограниченной ответственностью «Хендэ Мотор СНГ», ОГРН 1077746154067,
ИНН 7703623202, зарегистрированное по адресу: 123112, г. Москва, ул. Тестовская, д. 10,
ММДЦ Москва-Сити, Бизнес центр «Северная башня», 17 этаж (далее – Компания), в
лице Генерального директора Хван Ки Йон, действующего на основании Устава,
предлагает любому дееспособному физическому лицу, отвечающему определенным
требованиям, и намеревающемуся использовать Мобильное приложение «Mobility» (далее
– Пользователь), заключить настоящее соглашение об использовании Мобильного
приложения «Mobility» (далее, «Соглашение») посредством совершения Пользователем
акцепта настоящей публичной оферты.
Соглашение об использовании Мобильного приложения «Mobility» является
заключенным между Компанией и Пользователем с момента установки Пользователем
Мобильного приложения «Mobility» на свое Устройство и осуществления Пользователем
Регистрации в Мобильном приложении «Mobility» в порядке, определенном настоящим
Соглашением.
Перед использованием Мобильного приложения «Mobility» обязательно внимательное
прочтение Пользователем настоящего Соглашения и безоговорочное принятие всех его
условий.
Любое использование Пользователем Мобильного приложения «Mobility» означает
полное и безоговорочное принятие им условий настоящего Соглашения.
Если Пользователь не принимает условия Соглашения в полном объеме, Пользователь не
имеете права использовать Мобильное приложение «Mobility» в каких-либо целях.
1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
В настоящем Соглашении используются следующие термины, имеющие определенное
ниже значение. В случае, если в настоящем Соглашении используются термины и
понятия, не определенные в настоящем разделе, они имеют значения, которые обычно
придаются им в соответствующей сфере.
1.1. Авторизация Пользователя – осуществление определенного настоящим
Соглашением набора действий в Мобильном приложении в целях идентификации
зарегистрированного Пользователя для последующего использования функционала
Мобильного приложения.
1.2. Договор аренды ТС – договор аренды транспортного средства, заключаемый между
Пользователем и Компанией в электронной форме через Мобильное приложение,
путем присоединения Пользователя в соответствии со ст. 428 Гражданского кодекса
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 1 из 14
РФ к условиям договора, определенным Компанией. В случае если Пользователем
является физическое лицо-индивидуальный предприниматель или физическое лицо,
уполномоченное юридическим лицом, Договор аренды ТС может быть заключен
только в письменной форме (либо с помощью усиленной квалифицированной
электронной подписи, полученной в удостоверяющем центре) и на условиях,
отдельно согласованных Пользователем и Компанией. Заключение Договора аренды
ТС с юридическим лицом или индивидуальным предпринимателем в электронной
форме через Мобильное приложение невозможно.
1.3. Интернет-сайт – web-сайт Компании, доступный Пользователям в публичной
информационно-телекоммуникационной сети Интернет по сетевому адресу:
mobility.hyundai.ru.
1.4. Код подтверждения – уникальная последовательность символов, автоматически
сформированная Компанией и направленная Пользователю СМС-сообщением на
номер мобильного телефона, указанный при Регистрации, для доступа к
Мобильному приложению с Устройства Пользователя.
1.5. Личный кабинет Пользователя – персональная страница Пользователя в
Мобильном приложении, доступная Пользователю с использованием его Учетной
записи, которая содержит персональные данные Пользователя, а также иную
информацию, необходимую для использования функционала Мобильного
приложения.
1.6. Логин – абонентский номер, идентифицирующий Устройство Пользователя в сети
подвижной связи (номер мобильного телефона), указанный Пользователем при
Регистрации в Мобильном приложении.
1.7. Мобильное приложение – программное обеспечение для мобильных электронных
устройств, актуальная версия которого размещена правообладателем в Интернетсервисе AppStore и Google Play, доступных в публичной информационнотелекоммуникационной сети «Интернет» по сетевым адресам: itunes.apple.com и
play.google.com соответственно. Мобильное приложение, в том числе, представляет
собой информационную систему, оператором которой является Компания.
Исключительное право на Мобильное приложение принадлежит Компании в силу
факта создания. Системные требования к установке мобильного приложения:
iOS 9.0 и выше, Android 5.0 и выше.
1.8. Пользователь – физическое лицо, отвечающее требованиям настоящего
Соглашения и Договора аренды ТС, прошедшее процедуры
Регистрации/Авторизации и безоговорочно принявший условия настоящего
Соглашения в соответствии с его требованиями. Физическое лицо, уполномоченное
юридическим лицом, или индивидуальный предприниматель приобретают статус
Пользователя после выполнения соответствующих условий (раздел 5 настоящего
Соглашения). Физическое лицо и/или физическое лицо-индивидуальный
предприниматель, выбравшее в Мобильном приложении тарифный план для
юридических лиц, действует в рамках тарифного плана для юридических лиц от
имени соответствующего юридического лица или индивидуального
предпринимателя, и все права и обязанности возникают в этом случае у
соответствующего юридического лица или индивидуального предпринимателя.
1.9. Контент – все объекты, самостоятельно размещенные Пользователем в Мобильном
приложении, включая графические, текстовые, фото – объекты (произведения),
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 2 из 14
являющиеся объектами интеллектуальных прав или не являющиеся таковыми, права
(в том числе исключительное право на объекты интеллектуальных прав) на которые
принадлежат либо Пользователю, либо иным правообладателям.
1.10. Политика конфиденциальности – документ, регулирующий цели, способы и
порядок получения, обработки и хранения информации о Пользователе для
предоставления доступа к Мобильному приложению, заключения настоящего
Соглашения, а также для заключения и исполнения Договора аренды ТС. Политика
конфиденциальности размещена в Мобильном приложении и на Интернет-сайте.
1.11. Регистрация Пользователя – совершение Пользователем и Компанией
определенного в настоящем Соглашении набора действий, направленного на
создание в Мобильном приложении Учетной записи Пользователя с целью его
идентификации среди других Пользователей Мобильного приложения и получения
Пользователем доступа к функционалу Мобильного приложения.
1.12. Служба поддержки – служба Компании, осуществляющая в режиме двадцать
четыре часа, семь дней в неделю, без выходных и праздничных дней,
консультационную поддержку Пользователей, а также помощь Пользователям и их
информирование в процессе использования Мобильного приложения и аренды ТС.
Поддержка и консультирование осуществляются при обращении Пользователя в
Службу поддержки по телефону +7 800 551 01 21 или по электронной почте
feedback@mobility.hyundai.ru
1.13. Транспортное средство (ТС) – легковое транспортное средство, предоставляемое
Пользователю на условиях Договора аренды ТС.
1.14. Устройство – мобильное электронное устройство Пользователя (смартфон,
мобильный телефон), подключенное к публичной информационнотелекоммуникационной сети Интернет, работающее на базе операционной системы
iOS или Android, на котором установлено Мобильное приложение.
1.15. Учетная запись – совокупность цифровых данных, сформированная Компанией из
данных, представленных Пользователем в соответствии с разделом 3 настоящего
Соглашения (в том числе Логин) и направленного Компанией Пользователю Кода
подтверждения, необходимая для доступа Пользователя и осуществления действий,
предусмотренных Мобильным приложением и Договором аренды ТС.
Настоящим Компания и Пользователь соглашаются и подтверждают, что
совокупность цифровых данных, составляющих Логин и Код подтверждения, будет
расцениваться ими согласно Федеральному закону от 06.04.2011 №63-ФЗ «Об
электронной подписи» в качестве простой электронной подписи Пользователя в
дальнейших взаимоотношениях Сторон в рамках Мобильного приложения (далее,
«Электронная подпись»). Пользователь обязуется соблюдать конфиденциальность в
отношении Кода подтверждения, являющегося ключом Электронной подписи. Во
взаимоотношениях между Пользователем, действующим от имени юридического
лица, и Компанией или индивидуальным предпринимателем и Компанией простая
электронная подпись Пользователя не применима и является недействительной.
1.16. Лицензия – простая (неисключительная) непродаваемая отзывная безвозмездная
лицензия на использования Мобильного приложения Компании.
2. ПРЕДМЕТ СОГЛАШЕНИЯ И ОБЩИЕ ПОЛОЖЕНИЯ
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 3 из 14
2.1. Компания предоставляет Пользователю право на использование Мобильного
приложения Компании на условиях Лицензии в пределах и способами,
определенными настоящим Соглашением. Срок действия Лицензии – с даты начала
использования Пользователем Мобильного приложения до момента удаления
учетной записи в мобильном приложении «Mobility», путем направления запроса на
электронную почту feedback@mobility.hyundai.ru
2.2. Использование Мобильного приложения допускается на территории всех стран
мира.
2.3. Компания предоставляет Пользователю право использовать Мобильное приложение
по его прямому функциональному назначению для получения услуг Компании.
2.4. Мобильное приложение предоставляется Пользователю в целях получения услуг
Компании. Иные способы использования Мобильного приложения, кроме прямо
предусмотренных в настоящем Соглашении, запрещены. В частности, Пользователь
не вправе:
 выдавать сублицензии, продавать, переуступать, давать в пользование и аренду,
распространять, передавать или иным образом предоставлять права на
использование Мобильного приложения третьим лицам;
 изменять (модифицировать), декомпилировать, дизассемблировать, дешифровать
(декодировать), переводить на другие языки, нарушать целостность,
восстанавливать исходный код Мобильного приложения или каких-либо его
частей, а также производить иные действия с объектным кодом и исходным
текстом Мобильного приложения, в частности, для целей получения информации
о реализации алгоритмов, используемых в Мобильном приложении;
 создавать производные произведения с использованием Мобильного приложения,
а также осуществлять (разрешать осуществлять) иное использование Мобильного
приложения, любых его компонентов, хранимых Мобильным приложением на
Устройстве Пользователя картографических материалов, иных изображений и
прочих данных;
 осуществлять массовую рассылку информации или Контента с использованием
Мобильного приложения, а также размещать в Мобильном приложении Контент,
права на размещение которого отсутствуют у Пользователя и/или которые
являются: незаконными; компрометирующими (дискредитирующими,
порочащими честь и достоинство или деловую репутацию); оскорбительными;
нарушающими неприкосновенность частной жизни третьих лиц;
способствующими разжиганию национальной, расовой или религиозной
ненависти или вражды или дискриминации по любым признакам, или
пропагандирующими данные явления; демонстрирующими или
пропагандирующими насилие, жестокое обращение с животными; вульгарными
или непристойными; содержащими экстремистские материалы; содержащими
информацию ограниченного доступа; носящими заведомо ложный и/или
недостоверный характер; пропагандирующими преступную деятельность;
государственной, коммерческой, банковской, налоговой тайной и любой иной
информацией, охраняемой законодательством Российской Федерации;
запрещенной к распространению в соответствии законодательством Российской
Федерацией;
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 4 из 14
 воспроизводить и распространять Мобильное приложение в коммерческих целях
(в том числе за плату), в том числе в составе коммерческих продуктов;
 использовать Мобильное приложение для нарушения прав третьих лиц, а также
целей, противоречащих действующему законодательству.
2.5. Использование Мобильного приложения разрешается следующими способами:
 Пользователь вправе произвести копирование и установку Мобильного
приложения в память неограниченного числа своих Устройств;
 Пользователь вправе воспроизводить Мобильное приложение на своих
Устройствах;
 Пользователь вправе использовать Мобильное приложение по прямому
функциональному назначению в целях, определённых в п. 2.3. и п. 2.7
Соглашения.
Все перечисленные в настоящем пункте действия по использованию Мобильного
приложения должны осуществляться Пользователем лично. Передача права пользования
Мобильным приложением третьим лицам не допускается.
2.6. Мобильное приложение может быть использована Пользователем для совершения
операций и получения услуг Компании.
2.7. Использование Мобильного приложения возможно только при условии Регистрации
и Авторизации Пользователя в Мобильном приложении в соответствии с
установленной настоящим Соглашением последовательностью действий. Перед
началом использования Мобильного приложения Пользователь обязуется
ознакомиться с текстом данного Соглашения. Если Пользователь не согласен, с
каким-либо отдельным положением или с Соглашением в целом, он обязан
прекратить любое использование Мобильного приложения. Пользователь, выражая
свое согласие с условиями настоящего Соглашения в соответствии с п. 3.3.
Соглашения и в совокупности с фактом продолжения использования Мобильного
приложения, тем самым безоговорочно и полностью соглашается со всеми
условиями настоящего Соглашения.
2.8. Использование некоторых функций Мобильного приложения возможно только при
наличии доступа Устройства Пользователя к сети Интернет. Пользователь
самостоятельно получает и оплачивает такой доступ на условиях и по тарифам
своего оператора связи или провайдера доступа к сети Интернет.
2.9. Настоящим Компания и Пользователь соглашаются и подтверждают, что в рамках
Мобильного приложения они взаимно признают электронные документы,
подписанные простой электронной подписью, равнозначными документам на
бумажных носителях, подписанным собственноручной подписью, и влекущими
юридическую обязательность для Сторон.
2.10. Подписание электронного документа электронной подписью в рамках и в случаях,
предусмотренных определенными функциями Мобильного приложения,
производится Сторонами посредством осуществления совокупности следующих
действий:
2.10.1. Со стороны Компании соглашения и иные значимые документы либо публикуются
в Мобильном приложении в форме публичной оферты или иного одностороннего
волеизъявления Компании, либо подписываются простой электронной подписью,
при этом под подписанными простой электронной подписью Компании Стороны
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 5 из 14
понимают сообщения, генерируемые и отправляемые Пользователю Мобильным
приложением push-уведомления либо СМС-сообщений, и тем самым позволяющие
идентифицировать Компанию.
2.10.2. Со стороны Пользователя формирование и направление Компании всех
электронных документов осуществляется через функционал Мобильного
приложения под Учетной записью Пользователя, данные которой указываются им
при Авторизации, посредством нажатия Пользователем активных клавиш.
2.11. Компания предоставляет Пользователю Мобильное приложение, а также любую
информацию, содержащуюся в Мобильном приложении на условиях «как есть» («as
is») без гарантий любого рода. Компания не предоставляет никаких гарантий в
отношении безошибочной и бесперебойной работы Мобильного приложения или
отдельных его компонентов и/или функций, соответствия Мобильного приложения
конкретным целям и ожиданиям Пользователя, а также не предоставляет никаких
иных гарантий, прямо не указанных в настоящем Соглашении.
3. РЕГИСТРАЦИЯ ПОЛЬЗОВАТЕЛЯ
3.1. Для Регистрации Пользователь самостоятельно совершает установку Мобильного
приложения на свое Устройство с использованием Интернет-сервисов AppStore или
Google Play, доступных в публичной информационно-телекоммуникационной сети
«Интернет» по сетевому адресу: itunes.apple.com и play.google.com соответственно.
3.2. После запуска Мобильного приложения на своем Устройстве для Регистрации
Пользователь вводит в Мобильном приложении номер своего мобильного телефона
(Логин) и адрес электронной почты.
3.3. В Мобильном приложении Пользователю предоставляются на ознакомление
(посредством отображения в Мобильном приложении на экране Устройства):
 настоящее Соглашение;
 Согласие Пользователя на обработку его персональных данных;
 Политика конфиденциальности.
Пользователь не может начать Регистрацию, не согласившись с условиями
указанных документов. Пользователь, своевременно не ознакомившийся с
условиями указанных документов, принимает на себя все риски, связанные с
неблагоприятными последствиями для Пользователя.
Нажимая в Мобильном приложении активную клавишу «Далее», Пользователь
выражает свое безусловное согласие с настоящим Соглашением и также дает свое
согласие на обработку персональных данных Пользователя на условиях Политики
конфиденциальности с использованием средств автоматизации и/или без
использования таких средств Компанией, а также третьими лицами, указанными в
тексте Согласия.
3.4. После нажатия Пользователем в Мобильном приложении активной клавиши
«Далее» на указанный Пользователем номер мобильного телефона системой
Компании автоматически генерируется (создается) и направляется по СМСсообщению одноразовый Код подтверждения (пароль), после ввода которого в
Мобильном приложении Пользователю предоставляется возможность
осуществления дальнейших действий по Регистрации.
В последующем при Авторизации в Мобильном приложении Логином для доступа к
Личному кабинету Пользователя является номер мобильного телефона, указанный
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 6 из 14
Пользователем при Регистрации. Код подтверждения (одноразовый пароль) для
входа в Личный кабинет автоматически генерируется (создается) в системе
Компании и направляется Пользователю по СМС-сообщению каждый раз при
необходимости входа в Личный кабинет.
3.5. После ввода в Мобильном приложении Кода подтверждения (пароль) в соответствии
с п. 3.4 настоящего Соглашения для Регистрации Пользователь посредством
технических возможностей Мобильного приложения делает и направляет Компании:
 фотографии паспорта (страницы с фотографией и данными о регистрации по
месту жительства/пребывания);
 фотографии своего водительского удостоверения полностью (с двух сторон);
 личную фотографию совместно с паспортом, открытом на развороте с
фотографией (селфи).
Мобильное приложение не предусматривает загрузку с Устройства ранее созданных
фотографий. Осуществляется прикрепление только фотографий, сделанных в
процессе Регистрации посредством встроенной в Мобильное приложение
программы для фотосъемки. Все фотоизображения должны быть четкими.
Нечеткость фотографий является основанием для отказа в Регистрации.
3.6. Для Регистрации в Мобильном приложении Пользователь должен ввести данные
своей банковской карты, с которой будут списываться денежные средства в счет
платежей, предусмотренных Договором аренды ТС. Согласие предоставить данные
банковской карты подтверждается нажатием Пользователем активной клавиши
«Добавить карту», после чего Пользователь через шлюз передачи данных вводит в
поле ввода номер банковской карты, срок ее действия, код CVC, имя владельца и
нажимает активную клавишу «Добавить», передавая указанные данные банку,
обслуживающему Компанию. Сведения о банковской карте направляются через
шлюз передачи данных непосредственно в банк, обслуживающий Компанию,
исключая получение Компанией вводимых Пользователем данных банковской
карты. Компания получает от банка, обслуживающего Компанию лишь сведения о
номере банковской карты в виде маски 1111 **** **** 1111.
Допускается использование рублевых банковских карт платежных систем VISA и
MASTERCARD, выпущенных на территории РФ, с наличием возможности
совершения Интернет-платежей. Возможность совершения Интернет-платежей
обеспечивается Пользователем самостоятельно через банк, выпустивший
банковскую карту.
Вводя в Мобильном приложении данные своей банковской карты, Пользователь дает
согласие на списание Компанией или по ее поручению привлеченным банком
(платежной системой) денежных средств с указанной банковской карты в счет
любых платежей и погашения задолженности по Договору аренды ТС в
безакцептном порядке, без получения дополнительного согласия Пользователя.
Совокупность действий Пользователя, указанных в п.п. 3.1-3.6 настоящего
Соглашения, означает выражение его воли на присоединение к настоящему
Соглашению, составление и подачу заявки на Регистрацию в Мобильном
приложении. Фактическое начало использование Пользователем Мобильного
приложения является подтверждением присоединения Пользователя к условиям
Соглашения по смыслу и в порядке п. 5 ст.1286 Гражданского кодекса РФ.
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 7 из 14
3.7. Принимая условия настоящего Соглашения и осуществляя действия по Регистрации,
Пользователь подтверждает, что он:
 владеет русским языком на уровне, достаточном для прочтения и осознания
смысла и значения настоящего Соглашения;
 согласен на хранение, сбор, уточнение (обновление, изменение), удаление,
обработку (включая автоматизированную обработку) и использование данных о
географическом местоположении (географические координаты) устройства
Пользователя (на основе данных сети оператора сотовой связи и сигналов GPS)
и месте совершения Пользователем операций в целях информирования
Пользователя о местоположении при использовании Мобильного приложения,
а также о дополнительных сервисах, доступных Пользователю и
обусловленных его географическим местоположением;
 согласен на получение от Компании любых уведомлений, сообщений,
информации и рассылок (включая рекламных) в любом формате, при условии
соответствия их содержания требованиям действующего законодательства РФ.
3.8. Пользователь гарантирует, что предоставленные им при Регистрации в Мобильном
приложении данные являются полными, действительными и достоверными, что он
является держателем банковской карты, введенной им. Мобильном приложении.
Компания оставляет за собой право в любой момент потребовать от Пользователя
подтверждения данных, указанных при Регистрации, и запросить в связи с этим
подтверждающие документы, непредоставление которых, по усмотрению Компании,
может быть приравнено к предоставлению недостоверной информации и повлечь
отказ в Регистрации блокировку Учетной записи Пользователя или расторжение
настоящего Соглашения.
3.9. После совершения Пользователем всех указанных действий по регистрации
Компания в течение 24 (двадцати четырех) часов (Компания вправе увеличить этот
срок до 14 (четырнадцати) дней) проводит проверку Пользователя и
предоставленных им данных, и в этот же срок на основе предоставленной
Пользователем и/или полученной Компанией от третьих лиц информации принимает
решение о возможности Регистрации Пользователя. В случае если Пользователь при
Регистрации предоставляет недостоверную информацию или нечитаемую
информацию, либо если у Компании есть основания полагать, что представленная
Пользователем информация недостоверна, Компания вправе по своему усмотрению
отказать в Регистрации без объяснения причин.
3.10. Пользователь предупреждается о том, что в целях проверки банковской карты с нее
будет осуществлено списание денежных средств в размере 1 (одного) рубля с
последующим возвратом на банковскую карту в течение 24 (двадцати четырех)
часов с момента списания.
3.11. О принятом решении Компания вправе известить Пользователя через Мобильное
приложение либо посредством иных средств связи, сведения о которых были
предоставлены Пользователем при Регистрации. Одновременно с извещением
Компания предоставляет для ознакомления Пользователю в Мобильном приложении
текст Договора аренды ТС, для присоединения к которому Пользователь нажимает
соответствующие активные клавиши в Мобильном приложении.
По окончании Регистрации все вызовы в Службу поддержки осуществляются
Пользователем с номера мобильного телефона, указанного при Регистрации.
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 8 из 14
Пользователь может изменить номер мобильного телефона, указанный им при
Регистрации, обратившись в Службу поддержки по электронной почте со своего
адреса электронной почты, указанного при Регистрации.
4. АВТОРИЗАЦИЯ ПОЛЬЗОВАТЕЛЯ
4.1. В целях идентификации Пользователя при входе в Мобильное приложение
осуществляется Авторизация Пользователя.
4.2. Авторизация Пользователя производится в следующем порядке:
1) при запуске Мобильного приложения на Устройстве Пользователь должен
ввести в специальном поле ввода Логин;
2) Компания направляет на данный номер СМС-сообщение с Кодом
подтверждения (уникальный одноразовый пароль);
3) получив Код подтверждения, Пользователь вводит его в специальное поле,
подтверждая таким образом, что запуск и использование Мобильного
приложения осуществляется именно Пользователем, Учетная запись которого
связана с указанным Логином.
4.3. В случае ввода недостоверной пары «Логин + Код подтверждения», в доступе к
Мобильному приложению будет отказано. В случае ввода достоверной пары «Логин
+ Код подтверждения», Пользователь получает доступ к Личному кабинету и
функционалу Мобильного приложения.
5. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
5.1. После прохождения процедур Регистрации Пользователя и Авторизации
Пользователя, Пользователю станут доступны в Мобильном приложении тарифные
планы, в перечне которых он может выбрать, среди прочих, тарифный план для
юридических лиц, который также распространяется на индивидуальных
предпринимателей.
5.2. Выбрав тарифный план для юридических лиц, Пользователь следует указаниям в
Мобильном приложении по регистрации в Мобильном Приложении в качестве
юридического лица или индивидуального предпринимателя, предоставляет указанные
в Мобильном приложении электронные образы (сканы) запрашиваемых документов.
5.3. После совершения Пользователем указанных в Мобильном приложении действий
по регистрации в качестве юридического лица или индивидуального предпринимателя,
Компания в течение 24 (двадцати четырех) часов (Компания вправе увеличить этот
срок до 14 (четырнадцати) дней) проводит проверку юридического лица или
индивидуального предпринимателя и предоставленных данных, и в этот же срок на
основе предоставленной Пользователем и/или полученной Компанией от третьих лиц
информации принимает решение о возможности регистрации Пользователя в качестве
юридического лица или индивидуального предпринимателя. В случае если
Пользователь предоставляет недостоверную информацию или нечитаемую
информацию, либо если у Компании есть основания полагать, что представленная
Пользователем информация недостоверна, Компания вправе по своему усмотрению
отказать в регистрации Пользователя в качестве юридического лица или
индивидуального предпринимателя без объяснения причин.
5.4. По результатам выполнения условий, указанных в настоящем разделе Соглашения,
Пользователю будет доступен функционал Мобильного приложения как для
физических лиц, так и для юридических лиц и индивидуальных предпринимателей.
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 9 из 14
Выбрав тарифный план, не относящийся к юридическим лицам и индивидуальным
предпринимателям, Пользователь действует лично от своего имени. Выбрав тарифный
план для юридических лиц и индивидуальных предпринимателей, Пользователь
действует от имени, соответственно, юридического лица или индивидуального
предпринимателя.
5.5. Договор аренды ТС с юридическими лицами и индивидуальными
предпринимателями заключается Компанией исключительно в письменной форме
(либо с помощью усиленной квалифицированной электронной подписи, полученной в
удостоверяющем центре) на условиях, согласованных сторонами.
6. ОБЯЗАННОСТИ И ОТВЕТСТВЕННОСТЬ ПОЛЬЗОВАТЕЛЯ
6.1. Пользователь обязуется соблюдать положения настоящего Соглашения и
действующее законодательство Российской Федерации, а также законные
требования Компании.
6.2. За неисполнение или ненадлежащее исполнение своих обязательств по настоящему
Соглашению Пользователь несет ответственность в соответствии с настоящим
Соглашением действующим и законодательством Российской Федерации.
6.3. Пользователь несет ответственность за все действия, осуществляемые им в
Мобильном приложении.
6.4. Пользователь обязуется самостоятельно отслеживать обновления Мобильного
приложения и своевременно устанавливать на своем Устройстве новую версию
Мобильного приложения.
6.5. Пользователь не должен допускать использование любым третьим лицом Логина и
Кода подтверждения. Компания не отвечает за возможный ущерб, потерю или порчу
данных, которые могут произойти из-за нарушения Пользователем данного
положения. Пользователь обязуется принимать надлежащие меры для сохранения в
тайне данных, используемых для Авторизации в Мобильном приложении, и
незамедлительно сообщать Компании о факте использования таких данных третьими
лицами. Пользователь несет все риски неблагоприятных последствий, связанных с
отсутствием такого сообщения.
6.6. Пользователь обязуется в случае смены номера мобильного телефона, и иных
данных (данных паспорта, водительского удостоверения и т.д.), указанных при
Регистрации, сообщить об этом Компании. Пользователь несет все риски
неблагоприятных последствий, связанных с отсутствием такого сообщения.
6.7. Пользователь обязуется не использовать какие-либо технологии и не предпринимать
никаких действий, которые могут нанести вред Мобильному приложению,
интересам и имуществу Компании.
6.8. О наличии ошибок или неполадок, возникших в процессе использования
Мобильного приложения Пользователь обязуется сообщать в Службу поддержки
Компании.
6.9. Пользователь настоящим соглашается с тем, что Мобильное приложение в целях
реализации своего полноценного функционала может осуществлять доступ к
камерам Устройства с целью получения и использования фотоизображений в рамках
услуг, реализуемых в Мобильном приложении, в том числе для создания и
сохранения фотоизображений в профиле Пользователя в Мобильном приложении, а
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 10 из 14
также для других целей, необходимых при использовании Мобильного приложения,
включая для целей получения услуг через Мобильное приложение.
6.10. Настоящее Соглашение не дает Пользователю никаких прав на использование
объектов интеллектуальной собственности, включая товарные знаки и знаки
обслуживания Компании или его партнеров, за исключением прав, прямо
предоставляемых настоящим Соглашением.
7. ГАРАНТИИ И ОТВЕТСТВЕННОСТЬ КОМПАНИИ
7.1. За неисполнение или ненадлежащее исполнение своих обязательств по настоящему
Соглашению Компания несет ответственность в соответствии с настоящим
Соглашением действующим и законодательством Российской Федерации.
7.2. Компания несет ответственность только за прямой действительный ущерб,
причиненный вследствие виновного невыполнения обязательств Компании, в
пределах суммы всех платежей (не включая возмещение расходов, штрафы и
убытки), уплаченных Пользователем Компании по Договору аренды ТС за весь срок,
предшествующий предъявлению Пользователем соответствующего требования, но
не более 12 (двенадцати) месяцев.
7.3. Компания не несет ответственности за временную неработоспособность платежных
систем, обеспечивающую прием и перевод платежей Пользователей, вызванную не
зависящими от Компании причинами, а также обстоятельствами непреодолимой
силы.
7.4. Компания не несет ответственность за использование Мобильного приложения с
Устройства Пользователя третьими лицами, в связи с чем все действия,
совершенные с Устройства Пользователя, считаются действиями Пользователя. В
случае, если какое-либо лицо получает доступ к Мобильному приложению под
Учетной записью Пользователя и возможность ее использования от имени
Пользователя, Пользователь обязан незамедлительно сообщить об этом Компании в
письменном виде (по электронной почте), либо обратившись в Службу поддержки. В
противном случае все действия, совершенные от имени Пользователя с
использованием Мобильного приложения, будут расцениваться как действия,
совершенные непосредственно Пользователем.
7.5. Действия любых третьих лиц, а также действия платежных систем, операторов связи
не являются действиями Компании, и ответственности за них Компания не несет.
7.6. Компания не несет ответственности за нарушение условий настоящего Соглашения,
если такое нарушение вызвано действием обстоятельств непреодолимой силы (форсмажор), включая среди прочих: действия и решения органов государственной власти
и/или местного самоуправления, пожар, наводнение, землетрясение, другие
стихийные действия, отсутствие электроэнергии и/или сбои работы компьютерной
сети, забастовки, гражданские волнения, беспорядки, любые иные обстоятельства,
которые могут повлиять на выполнение Компанией условий настоящей Соглашения.
7.7. Компания не несет ответственности за неисполнение либо ненадлежащее
исполнение своих обязательств, если это вызвано действиями/бездействием
Пользователя, находящимися вне контроля Компании, в том числе в результате
совершения ошибочных действий/бездействия Пользователя.
7.8. Компания не контролирует содержание Контента, размещенного, передаваемого,
используемого в Мобильном приложении. Пользователь несет самостоятельную
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 11 из 14
личную ответственность за любой Контент или иную информацию, которую он
размещает, передает и/или использует в Мобильном приложении или с его
помощью. В случае предъявления Компании претензий о нарушении прав третьих
лиц, а также при получении соответствующих запросов от уполномоченных
государственных органов о нарушении действующего законодательства в связи с
размещением, использованием, передачей Контента и/или информации
Пользователем и/или при возникновении соответствующих рисков, Компания имеет
право удалить соответствующий Контент и/или информацию.
8. СРОК ДЕЙСТВИЯ СОГЛАШЕНИЯ. ПОРЯДОК ИЗМЕНЕНИЯ И ОТКАЗА ОТ
СОГЛАШЕНИЯ
8.1. Пользователь принимает настоящее Соглашение путем совершения действий по
Регистрации, указанных в п. 3.3 настоящего Соглашения. Дата совершения
Пользователем указанных действий является датой вступления в силу настоящего
Соглашения.
8.2. Действие настоящего Соглашения распространяется на все последующие
обновления/новые версии Мобильного приложения. Соглашаясь с установкой
обновления/новой версии Мобильного приложения. Пользователь принимает
условия настоящего Соглашения для соответствующих обновлений/новых версий
Мобильного приложения, если обновление/установка новой версии Мобильного
приложения не сопровождается иным лицензионным соглашением.
8.3. Компания имеет право в любое время в одностороннем порядке вносить изменения в
условия настоящего Соглашения. Уведомление Пользователя о внесенных
изменениях в условия Соглашения размещается в новой версии Мобильного
приложения и/или на Интернет-сайте. Указанные изменения вступают в силу и
становятся обязательными с даты размещения (публикации) Компанией в
Мобильном приложении и/или на Интернет-сайте, если иное не оговорено в
соответствующей публикации. Пользователь обязуется самостоятельно
периодически осуществлять мониторинг Интернет-сайта и/или Мобильного
приложения на предмет изменения условий настоящего Соглашения. Риск
несоблюдения данного требования в полной мере лежит на Пользователе.
8.4. Компания вправе в одностороннем внесудебном порядке в любой момент отказаться
от исполнения Соглашения и отозвать Лицензию у любого Пользователя В этом
случае Соглашение считается прекращенным в момент отправки Пользователю
уведомления посредством Мобильного приложения (направления push-уведомления)
или отправки СМС-сообщения.
8.5. Прекращенное по любым основаниям настоящее Соглашение продолжает
действовать в части неисполненных обязательств Сторон вплоть до исполнения
указанных обязательств в полном объеме.
8.6. Любое нарушение условия настоящего Соглашения Пользователем ведет к
прекращению действия Лицензии. В случае использования Мобильного приложения
после прекращения действия лицензии Пользователь несет ответственность в
соответствии с законодательством Российской Федерации. В этом случае
Соглашение считается прекращенным в момент отправки Пользователю
уведомления посредством Мобильного приложения (направления push-уведомления)
или отправки СМС-сообщения.
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 12 из 14
8.7. Во всех случаях расторжения настоящего Соглашения Договор аренды ТС,
заключенный с соответствующим Пользователем, также считается расторгнутым с
даты расторжения настоящего Соглашения. .В случае прекращения действия
Соглашения или истечения срока Лицензии, Пользователь обязан незамедлительно
прекратить любое использование Мобильного приложения и удалить его из памяти
всех Устройств.
9. БЛОКИРОВКА ПОЛЬЗОВАТЕЛЕЙ
9.1. Компания вправе блокировать Учетную запись Пользователя (приостановить доступ
к Мобильному приложению) при наличии следующих обстоятельств:
 в случае нарушения Пользователем условий настоящего Соглашения, Договора
аренды ТС;
 при наличии у Пользователя неоплаченной задолженности по Договору аренды
ТС;
 в случае возникновения подозрений недобросовестности Пользователя (в том
числе, но не ограничиваясь, при предоставлении Пользователем недостоверных
сведений, невозможности списания денежных средств и проч.);
 в случаях попытки Пользователя ввести Компанию в заблуждение, предоставить
недостоверные данные, исказить факты;
 в случаях отказа выполнения требований Компании, предусмотренных или
вытекающих из настоящего Соглашения и Договора аренды ТС, в том числе
путем бездействия;
 в случаях, когда Пользователь не соответствует (прекратил соответствовать)
требованиям, предъявляемым Компанией к Пользователю;
 в случаях, когда у Компании есть основания для одностороннего отказа от
настоящего Соглашения и Договора аренды ТС в соответствии с соглашением
Сторон и действующим законодательством;
 в иных случаях, когда нарушения Пользователем, по мнению Компании,
исключают возможность дальнейшего использования Мобильного приложения
Пользователем;
 В случае бездействия Пользователя под Учетной записью в течении 6 месяцев.
9.2. Блокировка Учетной записи Пользователя означает ограничение доступного
Пользователю функционала Мобильного приложения под его Учетной записью.
9.3. Снятие блокировки Учетной записи Пользователя может быть связано с истечением
определенного периода времени, выполнением Пользователем своих обязательств,
устранения обстоятельств, явившихся основаниями для блокировки, а также иных
требований Компании. Блокировка Учетной записи может быть установлена на
период принятия решения о целесообразности дальнейшего взаимодействия с
Пользователем по Договору.
9.4. Пользователь соглашается с тем, что блокирование Учетной записи не является
основанием для предъявления Пользователем каких бы то ни было требований, в
том числе требований, связанных с невозможностью бронирования ТС или
получения ТС в аренду.
10. РАЗРЕШЕНИЕ СПОРОВ И ПОДСУДНОСТЬ
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 13 из 14
10.1. Все споры и разногласия по настоящему Соглашению разрешаются путем
переговоров с соблюдением обязательного претензионного порядка.
10.2. В случае, если Компания и Пользователь не пришли к решению посредством
переговоров в течение 10 (десяти) дней, споры и разногласия передаются на
разрешение в суд, в порядке, предусмотренном действующим законодательством РФ
по месту нахождения Компании, язык судопроизводства – русский.
10.3. По всем вопросам, связанным с использованием Мобильного приложения, и со
всеми претензиями Пользователь может обращаться в Службу поддержки
Компании. При обращении с претензией к Компании Пользователь должен
предоставить документы, подтверждающие обоснованность претензии, а также
указать свои данные, предоставленные им при Регистрации.
11. ПРОЧИЕ УСЛОВИЯ
11.1. В части, не урегулированной настоящим Соглашением, отношения Компании и
Пользователя регулируются действующим законодательством Российской
Федерации вне зависимости от места нахождения Компании, Пользователя или
Устройства Пользователя.
11.2. Пользователь, не принявший условия настоящего Соглашения, либо принявший их
по ошибке, должен сообщить об этом Компании и не вправе пользоваться
Мобильным приложением.
12. РЕКВИЗИТЫ КОМПАНИИ
Общество с ограниченной ответственностью «Хендэ Мотор СНГ»
Адрес: 123112, г. Москва, ул. Тестовская, д. 10, ММДЦ Москва-Сити, Бизнес центр
«Северная башня», 17 этаж
ОГРН 1077746154067, ИНН 7703623202, КПП 770301001
Генеральный директор ООО «Хендэ Мотор СНГ» ______________ Хван Ки Йон
Лицензионное соглашение об использовании Мобильного приложения «Mobility» страница 14 из 14""";

//* Authentification screen strings
const authCardTitle = "QR Code generator";
const authMainFontTitle = "Mazzard";
const onBoardingSwitcherList = [
  "lib/consts/assets/img/facebook.png",
  "lib/consts/assets/img/jungle.png",
  "lib/consts/assets/img/ninja.png",
  "lib/consts/assets/img/rain.png",
  "lib/consts/assets/img/twitter.png",
  "lib/consts/assets/img/youtube.png",
];

//* Routes strings
const String authorizationScreenRoute = "authorization";
const String QRMainList = "qrmainlist";

//* SharedPrefs strings
const String spkeyTermsOfUse = "TermsOfUse";
const String spKeyTypeOfAuth = "AUTH";
const String spKeyOfUsersLogin = "UserLogin";
const String spKeyOfUsersPassword = "UserPassword";
const String spAuthTypeFirebase = "FIREBASE";
const String spAuthTypeGoogle = "GOOGLE";

//* Assets Strings
const List<String> assetShapes = [
  "lib/consts/assets/img/shapes/circle-zebra-vertical.png",
  "lib/consts/assets/img/shapes/circle-zebra.png",
  "lib/consts/assets/img/shapes/circle.png",
  "lib/consts/assets/img/shapes/circular.png",
  "lib/consts/assets/img/shapes/diamond.png",
  "lib/consts/assets/img/shapes/dot.png",
  "lib/consts/assets/img/shapes/edge-cut-smooth.png",
  "lib/consts/assets/img/shapes/edge-cut.png",
  "lib/consts/assets/img/shapes/japnese.png",
  "lib/consts/assets/img/shapes/leaf.png",
  "lib/consts/assets/img/shapes/mosaic.png",
  "lib/consts/assets/img/shapes/pointed-edge-cut.png",
  "lib/consts/assets/img/shapes/pointed-in-smooth.png",
  "lib/consts/assets/img/shapes/pointed-in.png",
  "lib/consts/assets/img/shapes/pointed-smooth.png",
  "lib/consts/assets/img/shapes/pointed.png",
  "lib/consts/assets/img/shapes/round.png",
  "lib/consts/assets/img/shapes/rounded-in-smooth.png",
  "lib/consts/assets/img/shapes/rounded-in.png",
  "lib/consts/assets/img/shapes/rounded-pointed.png",
  "lib/consts/assets/img/shapes/square.png",
  "lib/consts/assets/img/shapes/star.png"
];

const List<String> assetEyes = [
  "lib/consts/assets/img/eye/frame0.png",
  "lib/consts/assets/img/eye/frame1.png",
  "lib/consts/assets/img/eye/frame2.png",
  "lib/consts/assets/img/eye/frame3.png",
  "lib/consts/assets/img/eye/frame4.png",
  "lib/consts/assets/img/eye/frame5.png",
  "lib/consts/assets/img/eye/frame6.png",
  "lib/consts/assets/img/eye/frame7.png",
  "lib/consts/assets/img/eye/frame8.png",
  "lib/consts/assets/img/eye/frame10.png",
  "lib/consts/assets/img/eye/frame11.png",
  "lib/consts/assets/img/eye/frame12.png",
  "lib/consts/assets/img/eye/frame13.png",
  "lib/consts/assets/img/eye/frame14.png",
  "lib/consts/assets/img/eye/frame16.png",
];

const List<String> assetEyeBallShapes = [
  "lib/consts/assets/img/eyeBallShape/ball0.png",
  "lib/consts/assets/img/eyeBallShape/ball1.png",
  "lib/consts/assets/img/eyeBallShape/ball2.png",
  "lib/consts/assets/img/eyeBallShape/ball3.png",
  "lib/consts/assets/img/eyeBallShape/ball5.png",
  "lib/consts/assets/img/eyeBallShape/ball6.png",
  "lib/consts/assets/img/eyeBallShape/ball7.png",
  "lib/consts/assets/img/eyeBallShape/ball8.png",
  "lib/consts/assets/img/eyeBallShape/ball10.png",
  "lib/consts/assets/img/eyeBallShape/ball11.png",
  "lib/consts/assets/img/eyeBallShape/ball12.png",
  "lib/consts/assets/img/eyeBallShape/ball13.png",
  "lib/consts/assets/img/eyeBallShape/ball14.png",
  "lib/consts/assets/img/eyeBallShape/ball15.png",
  "lib/consts/assets/img/eyeBallShape/ball16.png",
  "lib/consts/assets/img/eyeBallShape/ball17.png",
  "lib/consts/assets/img/eyeBallShape/ball18.png",
  "lib/consts/assets/img/eyeBallShape/ball19.png",
];

//*Firebase strings
const String firebaseStorageUserCollection = "users";

//*ONBOARDING STRINGS

const onBoardBackground = "lib/consts/assets/img/onboardingbackground.png";
const String onBoardingWelcomeStart = "GET STARTED";
const String onBoardingWelcomeMessage = "Welcome to QrGen!";
const String onBoardingWelcomeMessageSub =
    "With long expereince in the audio industry, we create the best QR codes";

//*AUTH STRINGS
const googleAuthIconRoute = "lib/consts/assets/img/google.png";
const String authorizationSignInTitle = "Let's Sign You In";
const String authorizationSignUpTitle = "Let's Sign You Up!";
const String authorizationSignInButton = "SIGN IN";
const String authorizationSignUpButton = "SIGN UP";
const String authorizationSignInSubTitle = "Welcome back, you've been missed!";
const String authorizationSignUpSubTitle =
    "Register and gain enjoyable expirience!";

const String authorizationEmail = "Email";
const String authorizationRetype = "Retype password";
const String authorizationPassword = "Password";
const String authorizationDontHaveAccount = "Don't have an account?";
const String authorizationAlreadyHaveAccount = "Already have an account?";
